In [17]:
import pandas as pd

In [18]:
import sqlite3

In [19]:
import os

In [20]:
db = sqlite3.connect("cars.db")

In [30]:
df = pd.read_csv(r"cars.csv",index_col = 0)

In [31]:
df.to_sql("cars", db, if_exists="replace")
def run_query(query):
    return pd.read_sql_query(query,db)
os.getcwd

In [32]:
query = """
SELECT *
FROM sqlite_master
ORDER BY name;
"""
run_query(query)

,type,name,tbl_name,rootpage,sql
0,table,cars,cars,2,"CREATE TABLE ""cars"" (\n""Number"" TEXT,\n ""Type..."
1,index,ix_cars_Number,cars,3,"CREATE INDEX ""ix_cars_Number""ON ""cars"" (""Number"")"

In [33]:
query = """
SELECT *
FROM cars;
"""
run_query(query)

  Number     Type  Capacity
0    SSD   Premio      1800
1    KCN  Fielder      1500
2    USG     Benz      2200
3    TCH      BMW      2000
4    KBQ    Range      3500
5    TBD   Premio      1800
6    KCP     Benz      2200
7    USD  Fielder      1500
8    UGB      BMW      2000
9    TBG    Range      3200